app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all