app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "cpf", "email", "bday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Renan"], ["cpf", 10348617437], ["email", "renan.ii@hotmail.com"], ["bday", "2016-04-28"], ["created_at", "2021-10-01 00:02:22.035407"], ["updated_at", "2021-10-01 00:02:22.035407"]]

  def destroy
    @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]